---
kind: type
id: T:Autodesk.Revit.DB.CustomFieldData
source: html/a52a5cda-3a0a-6866-bd0f-d2b9cb6e5ffe.htm
---
# Autodesk.Revit.DB.CustomFieldData

A class that offer access to the information about a custom field.

## Syntax (C#)
```csharp
public class CustomFieldData : IDisposable
```